############################################
#                                          #
#  2015.03.06 데이터그램 R 기초 실습 예제  #
#                                          #
############################################

###################
##### Phase 1 #####
###################

# 데이터셋 읽어오기 1 - CSV (read.csv)
# 데이터셋 읽어오기 2 - txt (read.delim, #)

# 데이터셋 특성 요약 명령어 1 - nrow
# 데이터셋 특성 요약 명령어 2 - ncol
# 데이터셋 특성 요약 명령어 3 - length
# 데이터셋 특성 요약 명령어 4 - head
# 데이터셋 특성 요약 명령어 5 - summary
# 데이터셋 특성 요약 명령어 6 - str

# column별 특성 파악 명령어 1 - min
# column별 특성 파악 명령어 2 - max
# column별 특성 파악 명령어 3 - mean
# column별 특성 파악 명령어 4 - sd
# column별 특성 파악 명령어 5 - sum

# 데이터셋 파악하기 1 - fix
# 데이터셋 파악하기 2 - table
# 데이터셋 파악하기 3 - plot

# 이건 뭐지? - ?function
# 숫자와 문자 - ""

# 특정 column 번호를 사용하여 추출하는 방법
# 특정 column 이름을 사용하여 추출하는 방법
# 특정 row 번호를 사용하여 추출하는 방법
# 특정 column에 값을 일괄 삽입하는 방법
# 특정 row에 값을 일괄 삽입하는 방법
# 특정 column과 row에 값을 삽입하는 방법
# 지정 column 범위에 값을 삽입하는 방법
# 지정 row 범위에 값을 삽입하는 방법
# 지정 column 범위와 지정 row 범위에 값을 삽입하는 방법


# R의 자료구조 1 - c
# R의 자료구조 2 - matrix
# R의 자료구조 3 - data.frame
# R의 자료구조 4 - list

# 데이터셋 저장하기 - write.csv

# 텍스트 데이터 다루기 1 - substr
# 텍스트 데이터 다루기 2 - paste0


###################
##### Phase 2 #####
###################

# 데이터셋 읽어오기

# 내가 원하는 데이터셋 만들기 1 - seq
# 내가 원하는 데이터셋 만들기 2 - rnorm
# 내가 원하는 데이터셋 만들기 3 - paste0
# 내가 원하는 데이터셋 만들기 4 - as.numeric
# 내가 원하는 데이터셋 만들기 5 - as.character
# 내가 원하는 데이터셋 만들기 6 - as.matrix
# 내가 원하는 데이터셋 만들기 7 - as.data.frame

# column별 특성 파악 명령어 - quantile
# column별 특성 파악 명령어 - sapply + class
# column별 특성 파악 명령어 - sapply + sum
# column별 특성 파악 명령어 - sapply + mean

# R 부려먹기 1 - for
# R 부려먹기 1.1 - for, print
# R 부려먹기 2 - 논리연산자
# R 부려먹기 3 - if

# 데이터셋 파악하기 1 - boxplot

# 또 다른 방법의 객체 할당(or 저장) - assign

# 연습문제(반복문,핸들링,성공적) - for/paste0/print/write


###################
##### Phase 3 #####
###################





